import apiConnect from "../apiConnect";

/*todo
* 1) дописать апи сервисы
* 2) создать интерфейс для логина, регистрациа
* 3) создать интефейс для профиля
*
* Ученик
* 1) создать интефрейс для тестов
* 2)  создать интефрейс для решения тестов , отображение вопроса, форма ответа
* 3) создать лицевой интерфейс для решения теста, с кнопкой начать тест
* 4) создать интерфейс  решенного теста и отображение рзульатата
*
* Учитель
* 1) создать интефрейс для тестов учителя
* 2) интерфейс создания теста
* 3) интерфейся для подписания ученико на тест
* 4) интерфейс изменения ответов  учеников
* */

class TestServiceAPI {

    async getTestById(id){
        try{
            const response =  await apiConnect.get(`/test/${id}`);
            return response.data
        }catch(err){
            console.error("Ошибка при получении теста:", err);
            throw err;
        }
    }

}


export default TestServiceAPI;
